tripplan/frontend/views/plano-viagem/_form.php

SELECT * FROM `destino`
---

// Tenta carregar destinos. Se a tabela não existir, usa uma lista vazia para não dar erro.
try {
    $todosDestinos = Destino::find()->all();