tripplan/frontend/controllers/DestinoController.php

    public function actionCreate($plano_viagem_id = null)
    {
        $model = new Destino();

        // Se vier ID pelo URL, guarda
        if ($plano_viagem_id) {
            $model->plano_viagem_id = $plano_viagem_id;
        }

        $cidadesDisponiveis = Destino::find()
            ->select(['nome_cidade'])
            ->distinct()
            ->orderBy('nome_cidade')
            ->column();
---
SELECT DISTINCT `nome_cidade` FROM `destino` ORDER BY `nome_cidade`

    protected function findModel($id)
    {
        if (($model = Destino::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `destino` WHERE `id`='48'