tripplan/frontend/controllers/FavoritoController.php

SELECT * FROM `destino` WHERE `id`='48'
SELECT * FROM `favorito` WHERE (`user_id`=5) AND (`destino_id`='48')
INSERT INTO `favorito` (`user_id`, `destino_id`) VALUES (5, 48)
---
    public function actionToggle($destino_id)
    {
        $userId = Yii::$app->user->id;

        $destino = Destino::findOne($destino_id);
        if (!$destino) {
            throw new NotFoundHttpException('Destino não encontrado');
        }

        // Procura se já existe (usando user_id)
        $favorito = Favorito::findOne(['user_id' => $userId, 'destino_id' => $destino_id]);

        if ($favorito) {
            // Se existe, remove
            $favorito->delete();
            Yii::$app->session->setFlash('success', 'Removido dos Favoritos');
        } else {
            // Se não existe, cria
            $novoFavorito = new Favorito();
            $novoFavorito->user_id = $userId;
            $novoFavorito->destino_id = $destino_id;

            // Tenta guardar
            if ($novoFavorito->save()) {