tripplan/frontend/controllers/PlanoViagemController.php

SELECT `nome_cidade`, `id` FROM `destino`
---
        }

        // Prepara a lista para o dropdown
        $listaDestinos = \common\models\Destino::find()
            ->select(['nome_cidade', 'id'])
            ->indexBy('id')
            ->column();

SELECT * FROM `plano_viagem` WHERE (`id`='16') AND (`user_id`=5)
---
    protected function findModel($id)
    {
        // Tenta encontrar um plano que tenha AQUELE id E que pertença ao UTILIZADOR logado
        $model = \common\models\PlanoViagem::findOne([
            'id' => $id,
            'user_id' => Yii::$app->user->id
        ]);