tripplan/frontend/controllers/ReviewController.php

SELECT * FROM `destino` WHERE `id`='48'
---
    public function actionCreate($destino_id)
    {
        // Verifica se o destino existe mesmo
        $destino = Destino::findOne($destino_id);