tripplan/frontend/views/estadia/_form.php

SELECT * FROM `destino`
---

    <?php
    // Vamos buscar os dados e ver se existem
    $destinos = Destino::find()->all();