tripplan/frontend/views/atividade/_form.php

            <?php else: ?>
                <div class="mb-3">
                    <label class="form-label fw-bold text-secondary">Plano de Viagem</label>
                    <?= $form->field($model, 'destino_id')->dropDownList(
                        ArrayHelper::map(PlanoViagem::find()->all(), 'id', 'nome_viagem'),
                        ['prompt' => 'Selecione o Plano de Viagem', 'class' => 'form-select']
                    )->label(false) ?>
---
SELECT * FROM `plano_viagem`